[
  {
    "name": "Potato Crusted Cod Sheet Pan Meal",
    "image": "https://www.realsimple.com/thmb/4-NXLSYBk6BS4BXyZmOT7nFx55s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/cod-potatoes-recipe-0520din-83b32a5837364192ba83616caee30ace.jpg",
    "description": "This easy to prepare sheet pan meal leverages the bounty of vegetable garden's and farmer's markets to your taste buds delight. It's perfect for entertaining with an emphasis on what's fresh and easy to make substitutions. Not a fan of fennel? Not a problem! Feel free to swap it out for something you love or simply remove from the recipe all together.",
    "serves": 4,
    "ingredients": [
      "2 packages Sea Cuisine Potato Crusted Wild Cod, (4 pieces total),1 teaspoon Paprika",
      "1 cup Cherry Tomatoes",
      "1 cup Broccoli Florets",
      "20 each Asparagus Stalks",
      "1 cup Red Onions, sliced thin",
      "1 cup Fennel, sliced thin",
      "8 ounces Carrots, sliced thin lengthwise",
      "8 ounce Fingerling Potatoes, sliced thin lengthwise",
      "1 each Large Leek, sliced in half lengthwise",
      "1 each Lemon, sliced thin into rounds",
      "a few fresh thyme sprigs",
      "2 tbsp. Vegetable Oil"
    ],
    "preparation": [
      "Prepare a sheet pan with parchment paper lining the bottom. Arrange rack in center of the oven and preheat to 425 ̊F. Add the halved potatoes to a small pot, cover with water and cook over medium heat.",
      "Arrange all of the vegetables around the prepared sheet pan. Add the lemons and thyme sprigs across the sheet pan as well. Drizzle the vegetables with all but 1 teaspoon of the vegetable oil and season(if desired) with salt and pepper.",
      "Remove frozen fillets from tray and place on the sheet pan, tucking the portions in between the various vegetables and bake in the preheated oven for 22-25 minutes.",
      "After cooking the potatoes for ten minutes turn off the heat and strain from the water.",
      "Halfway through cooking the cod sheet pan remove from the oven and flip the portions over. Add the par-cooked potatoes, drizzle with the remaining vegetable oil and return to the oven cooking for the remaining 12-15 minutes. Cook to a minimum internal temperature of 155 ̊F.",
      "Garnish the Potato Crusted Cod with a sprinkle of paprika and enjoy!"
    ]
  },
  {
    "name": "Lemon Herb Baked Salmon",
    "image": "https://www.savoryonline.com/app/uploads/recipes/30125/lemon-herb-baked-salmon-recipe.jpg",
    "description": "This flavorful baked salmon dish is infused with zesty lemon and aromatic herbs, making it a delightful choice for a healthy and satisfying meal.",
    "serves": 4,
    "ingredients": [
      "4 salmon fillets (6 ounces each)",
      "2 tablespoons olive oil",
      "2 cloves garlic, minced",
      "1 lemon, sliced",
      "2 tablespoons fresh parsley, chopped",
      "1 tablespoon fresh dill, chopped",
      "Salt and pepper to taste"
    ],
    "preparation": [
      "Preheat the oven to 375°F (190°C).",
      "Place the salmon fillets on a baking sheet lined with parchment paper.",
      "Drizzle olive oil over the salmon fillets, then sprinkle with minced garlic, chopped parsley, and dill.",
      "Season with salt and pepper to taste, then place lemon slices on top of each fillet.",
      "Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.",
      "Serve hot, garnished with additional fresh herbs if desired."
    ]
  },
  {
    "name": "Grilled Teriyaki Tuna Steaks",
    "image": "https://themayakitchen.com/wp-content/uploads/2017/07/pan-seared-tuna-the-maya-kitchen.jpg",
    "description": "These grilled teriyaki tuna steaks are marinated in a flavorful sauce, then grilled to perfection, resulting in tender and juicy fish with a deliciously caramelized exterior.",
    "serves": 4,
    "ingredients": [
      "4 tuna steaks (6 ounces each)",
      "1/2 cup teriyaki sauce",
      "2 tablespoons soy sauce",
      "2 tablespoons honey",
      "2 cloves garlic, minced",
      "1 tablespoon sesame oil",
      "Sesame seeds for garnish (optional)",
      "Green onions, chopped, for garnish (optional)"
    ],
    "preparation": [
      "In a shallow dish, whisk together teriyaki sauce, soy sauce, honey, minced garlic, and sesame oil.",
      "Place the tuna steaks in the marinade, turning to coat evenly. Cover and refrigerate for at least 30 minutes, or up to 2 hours.",
      "Preheat the grill to medium-high heat. Remove the tuna steaks from the marinade and discard the marinade.",
      "Grill the tuna steaks for 2-3 minutes per side, or until desired doneness is reached, basting with additional teriyaki sauce if desired.",
      "Remove from the grill and let rest for a few minutes before serving.",
      "Garnish with sesame seeds and chopped green onions, if desired, and serve hot."
    ]
  },
  {
    "name": "Coconut Curry Cod",
    "image": "https://www.abelandcole.co.uk/media/2732_22488_x.jpg",
    "description": "This coconut curry cod is a flavorful and aromatic dish that combines tender cod fillets with creamy coconut milk and spicy curry paste for a deliciously satisfying meal.",
    "serves": 4,
    "ingredients": [
      "4 cod fillets (6 ounces each)",
      "1 tablespoon vegetable oil",
      "1 onion, diced",
      "2 cloves garlic, minced",
      "1 tablespoon ginger, grated",
      "2 tablespoons red curry paste",
      "1 can (14 ounces) coconut milk",
      "1 tablespoon fish sauce",
      "1 tablespoon lime juice",
      "1 tablespoon brown sugar",
      "Salt and pepper to taste",
      "Fresh cilantro for garnish"
    ],
    "preparation": [
      "In a large skillet, heat vegetable oil over medium heat. Add diced onion and cook until softened, about 5 minutes.",
      "Add minced garlic and grated ginger to the skillet and cook for another minute, until fragrant.",
      "Stir in red curry paste and cook for 1-2 minutes, until fragrant.",
      "Add coconut milk, fish sauce, lime juice, and brown sugar to the skillet, stirring to combine. Bring to a simmer.",
      "Season cod fillets with salt and pepper, then add them to the skillet, spooning some of the curry sauce over the top.",
      "Cover and cook for 5-7 minutes, or until the cod is cooked through and flakes easily with a fork.",
      "Garnish with fresh cilantro and serve hot, with rice or naan bread if desired."
    ]
  },
  {
    "name": "Soy Ginger Glazed Mahi Mahi",
    "image": "https://thestayathomechef.com/wp-content/uploads/2017/05/Ginger-Glazed-Baked-Mahi-Mahi-1200x720.jpg",
    "description": "This soy ginger glazed mahi mahi is a mouthwatering dish that combines the flavors of soy sauce, ginger, and garlic with tender mahi mahi fillets for a delicious and satisfying meal.",
    "serves": 4,
    "ingredients": [
      "4 mahi mahi fillets (6 ounces each)",
      "1/4 cup soy sauce",
      "2 tablespoons honey",
      "2 tablespoons rice vinegar",
      "2 cloves garlic, minced",
      "1 tablespoon ginger, grated",
      "1 tablespoon sesame oil",
      "1 tablespoon vegetable oil",
      "Sesame seeds and sliced green onions for garnish"
    ],
    "preparation": [
      "In a small bowl, whisk together soy sauce, honey, rice vinegar, minced garlic, grated ginger, and sesame oil to make the glaze.",
      "Heat vegetable oil in a large skillet over medium-high heat. Add mahi mahi fillets to the skillet and cook for 3-4 minutes per side, or until lightly browned.",
      "Pour the soy ginger glaze over the mahi mahi fillets, coating them evenly. Cook for another 2-3 minutes, or until the glaze has thickened slightly and the fish is cooked through.",
      "Remove from heat and transfer the mahi mahi fillets to a serving platter. Sprinkle with sesame seeds and sliced green onions for garnish.",
      "Serve hot, with steamed rice and vegetables if desired."
    ]
  },
  {
    "name": "Crispy Parmesan Crusted Halibut",
    "image": "https://youbetchacanmakethis.files.wordpress.com/2016/04/img_1199.jpg",
    "description": "Indulge in this crispy and flavorful Parmesan crusted halibut. The combination of Parmesan cheese and breadcrumbs creates a delicious crust that perfectly complements the tender halibut fillets.",
    "serves": 4,
    "ingredients": [
      "4 halibut fillets (6 ounces each)",
      "1/2 cup grated Parmesan cheese",
      "1/2 cup breadcrumbs",
      "2 tablespoons fresh parsley, chopped",
      "1 lemon, zested",
      "1/4 cup all-purpose flour",
      "2 eggs, beaten",
      "Salt and pepper to taste",
      "2 tablespoons olive oil"
    ],
    "preparation": [
      "Preheat the oven to 400°F (200°C).",
      "In a shallow dish, combine grated Parmesan cheese, breadcrumbs, chopped parsley, and lemon zest.",
      "Season the halibut fillets with salt and pepper. Dredge each fillet in flour, shaking off any excess.",
      "Dip the floured halibut fillets in beaten eggs, then coat them evenly with the Parmesan breadcrumb mixture, pressing gently to adhere.",
      "Heat olive oil in an oven-safe skillet over medium-high heat. Add the coated halibut fillets to the skillet and cook for 2-3 minutes per side, or until golden brown.",
      "Transfer the skillet to the preheated oven and bake for 8-10 minutes, or until the halibut is cooked through and flakes easily with a fork.",
      "Serve hot, garnished with additional fresh parsley and lemon wedges if desired."
    ]
  },
  {
    "name": "Asian Style Grilled Salmon",
    "image": "https://healthyrecipesblogs.com/wp-content/uploads/2023/08/asian-salmon-1-2023.jpg",
    "description": "Enjoy the bold flavors of Asia with this grilled salmon dish. Marinated in a flavorful blend of soy sauce, ginger, and garlic, the salmon is grilled to perfection, resulting in tender and succulent fillets that are bursting with flavor.",
    "serves": 4,
    "ingredients": [
      "4 salmon fillets (6 ounces each)",
      "1/4 cup soy sauce",
      "2 tablespoons rice vinegar",
      "2 tablespoons honey",
      "2 cloves garlic, minced",
      "1 tablespoon ginger, grated",
      "1 tablespoon sesame oil",
      "Sesame seeds and sliced green onions for garnish"
    ],
    "preparation": [
      "In a small bowl, whisk together soy sauce, rice vinegar, honey, minced garlic, grated ginger, and sesame oil to make the marinade.",
      "Place the salmon fillets in a shallow dish and pour the marinade over them, turning to coat evenly. Cover and refrigerate for at least 30 minutes, or up to 2 hours.",
      "Preheat the grill to medium-high heat. Remove the salmon fillets from the marinade and discard the marinade.",
      "Grill the salmon fillets for 4-5 minutes per side, or until cooked through and flaky.",
      "Remove from the grill and transfer to a serving platter. Garnish with sesame seeds and sliced green onions.",
      "Serve hot, with steamed rice and stir-fried vegetables if desired."
    ]
  },
  {
    "name": "Lemon Dill Baked Trout",
    "image": "https://www.thespruceeats.com/thmb/dVXHEtxgKvP_SjSLMSXdp7CIZ64=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/baked-whole-trout-recipe-1807447-hero-01-cae13775421d466b9fff64bc6f74b490.jpg",
    "description": "Savor the delicate flavor of trout with this simple and delicious baked trout recipe. Infused with lemon and dill, this dish is light, refreshing, and perfect for a healthy meal.",
    "serves": 4,
    "ingredients": [
      "4 trout fillets (6 ounces each)",
      "1 lemon, sliced",
      "2 tablespoons fresh dill, chopped",
      "2 tablespoons olive oil",
      "Salt and pepper to taste"
    ],
    "preparation": [
      "Preheat the oven to 375°F (190°C).",
      "Place the trout fillets on a baking sheet lined with parchment paper.",
      "Drizzle olive oil over the trout fillets, then season with salt and pepper.",
      "Arrange lemon slices on top of each fillet, then sprinkle with chopped dill.",
      "Bake in the preheated oven for 12-15 minutes, or until the trout is cooked through and flakes easily with a fork.",
      "Serve hot, garnished with additional fresh dill and lemon wedges if desired."
    ]
  },
  {
    "name": "Spicy Cajun Blackened Red Snapper",
    "image": "https://azestforlife.com/wp-content/uploads/2022/05/05.23.22-Cajun_Blackened_Red_Fish_19.jpg",
    "description": "Experience the bold and spicy flavors of the Cajun cuisine with this blackened red snapper recipe. Coated in a flavorful blend of spices and seared to perfection, this dish is sure to tantalize your taste buds.",
    "serves": 4,
    "ingredients": [
      "4 red snapper fillets (6 ounces each)",
      "2 tablespoons paprika",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 tablespoon dried thyme",
      "1 tablespoon dried oregano",
      "1 teaspoon cayenne pepper",
      "1 teaspoon black pepper",
      "1 teaspoon salt",
      "2 tablespoons olive oil"
    ],
    "preparation": [
      "In a small bowl, combine paprika, garlic powder, onion powder, dried thyme, dried oregano, cayenne pepper, black pepper, and salt to make the blackening spice blend.",
      "Rub the blackening spice blend evenly over both sides of the red snapper fillets, pressing gently to adhere.",
      "Heat olive oil in a skillet over medium-high heat. Once hot, add the seasoned red snapper fillets to the skillet.",
      "Cook the red snapper fillets for 3-4 minutes per side, or until blackened and cooked through.",
      "Remove from the skillet and transfer to a serving platter.",
      "Serve hot, with rice, coleslaw, and lemon wedges if desired."
    ]
  },
  {
    "name": "Honey Garlic Glazed Salmon",
    "image": "https://i.ytimg.com/vi/HQUj9kPBqTk/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLB5NgFf-zSCgLs5BKlF6yqkXJzIUQ",
    "description": "This honey garlic glazed salmon is a sweet and savory delight. The combination of honey, garlic, and soy sauce creates a flavorful glaze that perfectly complements the richness of the salmon.",
    "serves": 4,
    "ingredients": [
      "4 salmon fillets (6 ounces each)",
      "1/4 cup honey",
      "2 tablespoons soy sauce",
      "2 cloves garlic, minced",
      "1 tablespoon olive oil",
      "1 tablespoon lemon juice",
      "Salt and pepper to taste",
      "Sesame seeds and sliced green onions for garnish"
    ],
    "preparation": [
      "In a small bowl, whisk together honey, soy sauce, minced garlic, olive oil, and lemon juice to make the glaze.",
      "Season salmon fillets with salt and pepper.",
      "Place salmon fillets in a shallow dish and pour the glaze over them, turning to coat evenly. Cover and refrigerate for at least 30 minutes, or up to 2 hours.",
      "Preheat the oven to 400°F (200°C).",
      "Transfer salmon fillets to a baking dish lined with parchment paper, reserving the marinade.",
      "Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.",
      "Meanwhile, pour the reserved marinade into a small saucepan and bring to a simmer over medium heat. Cook for 3-4 minutes, or until slightly thickened.",
      "Remove salmon from the oven and brush with the thickened glaze.",
      "Garnish with sesame seeds and sliced green onions, and serve hot."
    ]
  },
  {
    "name": "Panko Crusted Tilapia",
    "image": "https://images.everyplate.com/c_fill,f_auto,fl_lossy,h_398,q_auto,w_600/everyplate_s3/image/crispy-baked-tilapia-c89bbba8.jpg",
    "description": "This panko crusted tilapia is crispy, flavorful, and incredibly easy to make. The tilapia fillets are coated in seasoned panko breadcrumbs and baked to golden perfection.",
    "serves": 4,
    "ingredients": [
      "4 tilapia fillets (6 ounces each)",
      "1 cup panko breadcrumbs",
      "2 tablespoons grated Parmesan cheese",
      "1 teaspoon garlic powder",
      "1 teaspoon paprika",
      "1/2 teaspoon dried oregano",
      "1/2 teaspoon dried thyme",
      "1/4 cup all-purpose flour",
      "2 eggs, beaten",
      "Salt and pepper to taste",
      "2 tablespoons olive oil"
    ],
    "preparation": [
      "Preheat the oven to 400°F (200°C).",
      "In a shallow dish, combine panko breadcrumbs, grated Parmesan cheese, garlic powder, paprika, dried oregano, and dried thyme.",
      "Season tilapia fillets with salt and pepper.",
      "Dredge each tilapia fillet in flour, shaking off any excess. Dip in beaten eggs, then coat evenly with the panko breadcrumb mixture, pressing gently to adhere.",
      "Heat olive oil in an oven-safe skillet over medium-high heat. Add the coated tilapia fillets to the skillet and cook for 2-3 minutes per side, or until lightly golden brown.",
      "Transfer the skillet to the preheated oven and bake for 8-10 minutes, or until the tilapia is cooked through and flakes easily with a fork.",
      "Serve hot, garnished with lemon wedges and fresh parsley if desired."
    ]
  },
  {
    "name": "Grilled Mahi Mahi Tacos",
    "image": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_1:1/k%2FPhoto%2FRecipes%2F2022-04_Mahi-Mahi-Tacos%2F2022-04-26_ATK3523",
    "description": "These grilled mahi mahi tacos are fresh, flavorful, and perfect for a summer meal. The grilled mahi mahi is topped with a tangy slaw and served in warm tortillas for a delicious seafood treat.",
    "serves": 4,
    "ingredients": [
      "4 mahi mahi fillets (6 ounces each)",
      "8 small flour tortillas, warmed",
      "1 cup shredded cabbage",
      "1/2 cup diced tomatoes",
      "1/4 cup diced red onion",
      "1/4 cup chopped cilantro",
      "1 avocado, sliced",
      "1 lime, cut into wedges",
      "Salt and pepper to taste",
      "1 tablespoon olive oil"
    ],
    "preparation": [
      "Preheat the grill to medium-high heat.",
      "Season mahi mahi fillets with salt, pepper, and olive oil.",
      "Grill mahi mahi fillets for 3-4 minutes per side, or until cooked through and grill marks form.",
      "Meanwhile, in a small bowl, combine shredded cabbage, diced tomatoes, diced red onion, and chopped cilantro to make the slaw. Season with salt and pepper to taste.",
      "Remove mahi mahi fillets from the grill and let rest for a few minutes.",
      "Flake mahi mahi fillets into bite-sized pieces.",
      "To assemble tacos, place a spoonful of slaw on each warmed tortilla, top with flaked mahi mahi, sliced avocado, and a squeeze of lime juice.",
      "Serve hot, with additional lime wedges if desired."
    ]
  },
  {
    "name": "Herb Crusted Cod with Lemon Butter Sauce",
    "image": "https://realfood.tesco.com/media/images/Lemon-and-herb-crusted-fish-with-caper-and-tarragon-mayo-HERO-b57105a7-3a92-401b-96a1-cff0080ee259-0-472x310.jpg",
    "description": "This herb crusted cod with lemon butter sauce is a light and flavorful dish that is perfect for a weeknight dinner. The cod fillets are coated in a mixture of fresh herbs and breadcrumbs, then topped with a tangy lemon butter sauce.",
    "serves": 4,
    "ingredients": [
      "4 cod fillets (6 ounces each)",
      "1/2 cup breadcrumbs",
      "2 tablespoons chopped fresh parsley",
      "1 tablespoon chopped fresh dill",
      "1 tablespoon chopped fresh chives",
      "1 lemon, zested",
      "Salt and pepper to taste",
      "2 tablespoons butter",
      "2 tablespoons lemon juice",
      "1 tablespoon capers, drained (optional)"
    ],
    "preparation": [
      "Preheat the oven to 400°F (200°C).",
      "In a small bowl, combine breadcrumbs, chopped fresh parsley, chopped fresh dill, chopped fresh chives, and lemon zest.",
      "Season cod fillets with salt and pepper, then press breadcrumb mixture onto the top of each fillet to coat evenly.",
      "Place cod fillets on a baking sheet lined with parchment paper.",
      "Bake in the preheated oven for 12-15 minutes, or until the cod is cooked through and flakes easily with a fork.",
      "Meanwhile, in a small saucepan, melt butter over medium heat. Add lemon juice and capers, if using, and cook for 1-2 minutes.",
      "Remove cod fillets from the oven and drizzle with lemon butter sauce.",
      "Serve hot, garnished with additional chopped fresh herbs if desired."
    ]
  },
  {
    "name": "Grilled Lemon Herb Trout",
    "image": "https://perfectlyprovence.co/wp-content/uploads/2018/04/Whole-Lemon-Thyme-Grilled-Trout.jpg",
    "description": "Grilled lemon herb trout is a light and refreshing dish perfect for summer evenings. The combination of fresh herbs and zesty lemon complements the delicate flavor of the trout beautifully.",
    "serves": 4,
    "ingredients": [
      "4 trout fillets (6 ounces each)",
      "2 tablespoons olive oil",
      "2 cloves garlic, minced",
      "1 lemon, sliced",
      "2 tablespoons fresh parsley, chopped",
      "1 tablespoon fresh dill, chopped",
      "Salt and pepper to taste"
    ],
    "preparation": [
      "Preheat the grill to medium-high heat.",
      "In a small bowl, whisk together olive oil, minced garlic, chopped parsley, chopped dill, salt, and pepper.",
      "Brush both sides of the trout fillets with the herb mixture.",
      "Place lemon slices on top of each trout fillet.",
      "Grill the trout fillets for 4-5 minutes per side, or until cooked through and flaky.",
      "Remove from the grill and transfer to a serving platter.",
      "Serve hot, garnished with additional fresh herbs and lemon wedges if desired."
    ]
  },
  {
    "name": "Cajun Style Blackened Catfish",
    "image": "https://i.imgur.com/MCjMMfa.jpeg",
    "description": "Cajun style blackened catfish is a flavorful and spicy dish that's sure to wake up your taste buds. The catfish fillets are coated in a bold blend of Cajun spices and seared to perfection.",
    "serves": 4,
    "ingredients": [
      "4 catfish fillets (6 ounces each)",
      "2 tablespoons paprika",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 tablespoon dried thyme",
      "1 tablespoon dried oregano",
      "1 teaspoon cayenne pepper",
      "1 teaspoon black pepper",
      "1 teaspoon salt",
      "2 tablespoons olive oil"
    ],
    "preparation": [
      "In a small bowl, combine paprika, garlic powder, onion powder, dried thyme, dried oregano, cayenne pepper, black pepper, and salt to make the blackening spice blend.",
      "Rub the blackening spice blend evenly over both sides of the catfish fillets, pressing gently to adhere.",
      "Heat olive oil in a skillet over medium-high heat. Once hot, add the seasoned catfish fillets to the skillet.",
      "Cook the catfish fillets for 3-4 minutes per side, or until blackened and cooked through.",
      "Remove from the skillet and transfer to a serving platter.",
      "Serve hot, with lemon wedges and tartar sauce if desired."
    ]
  },
  {
    "name": "Miso Glazed Salmon",
    "image": "https://img.taste.com.au/gOPcKMHK/taste/2020/04/sticky-honey-miso-glazed-salmon-160606-1.jpg",
    "description": "Miso glazed salmon is a savory and umami-packed dish that's sure to impress. The sweet and salty miso glaze caramelizes beautifully on the salmon fillets, creating a delicious crust.",
    "serves": 4,
    "ingredients": [
      "4 salmon fillets (6 ounces each)",
      "1/4 cup white miso paste",
      "2 tablespoons mirin",
      "2 tablespoons soy sauce",
      "2 tablespoons honey",
      "1 tablespoon rice vinegar",
      "1 tablespoon sesame oil",
      "1 tablespoon grated ginger",
      "1 clove garlic, minced",
      "Sesame seeds and sliced green onions for garnish"
    ],
    "preparation": [
      "In a small bowl, whisk together white miso paste, mirin, soy sauce, honey, rice vinegar, sesame oil, grated ginger, and minced garlic to make the miso glaze.",
      "Place salmon fillets in a shallow dish and pour the miso glaze over them, turning to coat evenly. Cover and refrigerate for at least 30 minutes, or up to 2 hours.",
      "Preheat the oven to 400°F (200°C).",
      "Transfer salmon fillets to a baking dish lined with parchment paper, reserving the marinade.",
      "Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.",
      "Meanwhile, pour the reserved marinade into a small saucepan and bring to a simmer over medium heat. Cook for 3-4 minutes, or until slightly thickened.",
      "Remove salmon from the oven and brush with the thickened glaze.",
      "Garnish with sesame seeds and sliced green onions, and serve hot."
    ]
  },
  {
    "name": "Coconut Curry Shrimp",
    "image": "https://www.simplyrecipes.com/thmb/WHv2VEAbjCWjz70KzCrpwBadYF8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2014__02__coconut-shrimp-curry-horiz-a-1200-f29bb59747a64222bcbc028469d1700b.jpg",
    "description": "Coconut curry shrimp is a comforting and aromatic dish that's perfect for a cozy dinner at home. The creamy coconut curry sauce is infused with fragrant spices and pairs beautifully with succulent shrimp.",
    "serves": 4,
    "ingredients": [
      "1 pound large shrimp, peeled and deveined",
      "1 tablespoon vegetable oil",
      "1 onion, diced",
      "2 cloves garlic, minced",
      "1 tablespoon grated ginger",
      "2 tablespoons red curry paste",
      "1 can (14 ounces) coconut milk",
      "1 cup vegetable broth",
      "2 tablespoons soy sauce",
      "1 tablespoon brown sugar",
      "1 red bell pepper, sliced",
      "1 cup snap peas",
      "1 lime, juiced",
      "Cooked rice for serving",
      "Fresh cilantro for garnish"
    ],
    "preparation": [
      "Heat vegetable oil in a large skillet over medium heat. Add diced onion and cook until softened, about 5 minutes.",
      "Add minced garlic and grated ginger to the skillet and cook for another minute, until fragrant.",
      "Stir in red curry paste and cook for 1-2 minutes, until fragrant.",
      "Add coconut milk, vegetable broth, soy sauce, and brown sugar to the skillet, stirring to combine. Bring to a simmer.",
      "Add sliced red bell pepper and snap peas to the skillet, and simmer for 5 minutes.",
      "Add shrimp to the skillet and cook for 3-4 minutes, or until shrimp are pink and cooked through.",
      "Stir in lime juice.",
      "Serve hot over cooked rice, garnished with fresh cilantro."
    ]
  },
  {
    "name": "Grilled Lemon Herb Trout",
    "image": "https://grillingexplained.com/wp-content/uploads/grilled-trout-with-lemon-butter-sauce-500x461.jpg",
    "description": "Grilled lemon herb trout is a light and refreshing dish perfect for summer evenings. The combination of fresh herbs and zesty lemon complements the delicate flavor of the trout beautifully.",
    "serves": 4,
    "ingredients": [
      "4 trout fillets (6 ounces each)",
      "2 tablespoons olive oil",
      "2 cloves garlic, minced",
      "1 lemon, sliced",
      "2 tablespoons fresh parsley, chopped",
      "1 tablespoon fresh dill, chopped",
      "Salt and pepper to taste"
    ],
    "preparation": [
      "Preheat the grill to medium-high heat.",
      "In a small bowl, whisk together olive oil, minced garlic, chopped parsley, chopped dill, salt, and pepper.",
      "Brush both sides of the trout fillets with the herb mixture.",
      "Place lemon slices on top of each trout fillet.",
      "Grill the trout fillets for 4-5 minutes per side, or until cooked through and flaky.",
      "Remove from the grill and transfer to a serving platter.",
      "Serve hot, garnished with additional fresh herbs and lemon wedges if desired."
    ]
  }
]
